// Задача 8: 
// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

Console.Clear();
Console.WriteLine("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());

int n0 = 1;
int n1 = 2;
while ( n0 <= n);
{
    Console.WriteLine(n0);
    n0= n0+2;

}



    // n%2==0, n =n -2;